#pragma once
#include <string>

class fraction_t {          // клас - це тип даних, тому є традиції додавати "_t"
private:                    // склад класу поділяється за "видимістю" на декілька категорій
	int numerator;          // поле - "змінна" в середині класу
	int denominator;        // набір полів називають "характеристиками" класу
public:                     // За рекомендаціями ООП поля мають бути приватними, 
	int get_numerator();    // а для доступу до них створюють методи ("функції"), що називають
	int get_denominator();  // аксесорами (які поділяють на геттери та сеттери)
	void set_numerator(int);   // набір методів класу також називають "поведінкою"
	void set_denominator(int);
	std::string to_string();
};
